In [1]:
import pandas as pd 
import pickle

In [2]:
with open('saved_steps.pkl', 'rb') as file:
    data = pickle.load(file)

In [3]:
model = data['model']
edu_dict = data['edu_dict']
code_dict = data['code_dict']
company_dict = data['company_dict']
employees_dict = data['employees_dict']
label_encoder = data['label_encoder']
numeric_cols = data['numeric_cols']
categorical_cols = data['categorical_cols']
onehot_encoder = data['onehot_encoder']
scaler = data['scaler']

In [55]:
df = pd.read_csv('data.csv')
df.columns

Index(['Age Group', 'Gender', 'Country', 'Education Level', 'Recent Job Title',
       'Coding Experience', 'Industry', 'Company Size', 'Num Language',
       'Average Annual Salary ($USD)'],
      dtype='object')

In [6]:
df.head()

,Age Group,Gender,Country,Education Level,Recent Job Title,Coding Experience,Industry,Company Size,Num Language,Average Annual Salary ($USD)
0,50-54,Man,India,Bachelor’s degree,Other,5-10,Manufacturing/Fabrication,50-249,2,27499.5
1,50-54,Man,Indonesia,Master’s degree,Program/Project Manager,20+,Manufacturing/Fabrication,"1000-9,999",4,64999.5
2,22-24,Man,Pakistan,Master’s degree,Software Engineer,1-3,Academics/Education,"1000-9,999",3,499.5
3,45-49,Man,Mexico,Doctoral degree,Research Scientist,20+,Academics/Education,"1000-9,999",1,34999.5
4,45-49,Man,India,Doctoral degree,Other,< 1,Academics/Education,50-249,3,34999.5

In [7]:
data = df.copy()

In [8]:
data['Age Group'].unique()

array(['50-54', '22-24', '45-49', '30-34', '40-44', '35-39', '18-21',
       '70+', '25-29', '55-59', '60-69'], dtype=object)

In [51]:
data['Gender'].unique()

array(['Man', 'Woman', 'Nonbinary', 'Prefer not to say',
       'Prefer to self-describe'], dtype=object)

In [52]:
sorted(list(data['Country'].unique()))

['Algeria',
 'Argentina',
 'Australia',
 'Austria',
 'Bangladesh',
 'Belarus',
 'Belgium',
 'Brazil',
 'Canada',
 'Chile',
 'China',
 'Colombia',
 'Czech Republic',
 'Denmark',
 'Ecuador',
 'Egypt',
 'Ethiopia',
 'France',
 'Germany',
 'Ghana',
 'Greece',
 'Hong Kong (S.A.R.)',
 'I do not wish to disclose my location',
 'India',
 'Indonesia',
 'Iran, Islamic Republic of...',
 'Iraq',
 'Ireland',
 'Israel',
 'Italy',
 'Japan',
 'Kazakhstan',
 'Kenya',
 'Malaysia',
 'Mexico',
 'Morocco',
 'Nepal',
 'Netherlands',
 'Nigeria',
 'Norway',
 'Other',
 'Pakistan',
 'Peru',
 'Philippines',
 'Poland',
 'Portugal',
 'Romania',
 'Russia',
 'Saudi Arabia',
 'Singapore',
 'South Africa',
 'South Korea',
 'Spain',
 'Sri Lanka',
 'Sweden',
 'Switzerland',
 'Taiwan',
 'Thailand',
 'Tunisia',
 'Turkey',
 'Uganda',
 'Ukraine',
 'United Arab Emirates',
 'United Kingdom of Great Britain and Northern Ireland',
 'United States of America',
 'Viet Nam']

In [49]:
list(data['Education Level'].unique())

['Bachelor’s degree',
 'Master’s degree',
 'Doctoral degree',
 'I prefer not to answer',
 'Some college/university study without earning a bachelor’s degree',
 'No formal education past high school',
 'Professional doctorate']

In [53]:
sorted(list(data['Recent Job Title'].unique()))

['Business Analyst',
 'DBA/Database Engineer',
 'Data Analyst',
 'Data Engineer',
 'Data Scientist',
 'Developer Relations/Advocacy',
 'Machine Learning Engineer',
 'Other',
 'Product Manager',
 'Program/Project Manager',
 'Research Scientist',
 'Software Engineer',
 'Statistician']

In [13]:
data['Coding Experience'].unique()

array(['5-10 ', '20+ ', '1-3 ', '< 1 ', '10-20 ', '3-5 ',
       'I have never written code'], dtype=object)

In [14]:
data['Company Size'].unique()

array(['50-249 ', '1000-9,999 ', '10,000 or more ', '0-49 ', '250-999 '],
      dtype=object)

In [54]:
sorted(list(data['Industry'].unique()))

['Academics/Education',
 'Accounting/Finance',
 'Broadcasting/Communications',
 'Computers/Technology',
 'Energy/Mining',
 'Government/Public Service',
 'Hospitality/Entertainment/Sports',
 'Insurance/Risk Assessment',
 'Manufacturing/Fabrication',
 'Marketing/CRM',
 'Medical/Pharmaceutical',
 'Military/Security/Defense',
 'Non-profit/Service',
 'Online Business/Internet-based Sales',
 'Online Service/Internet-based Services',
 'Other',
 'Retail/Sales',
 'Shipping/Transportation']

In [19]:
y = data.iloc[:1, -1]
y

0    27499.5
Name: Average Annual Salary ($USD), dtype: float64

In [20]:
X = data.iloc[:1, :-1]
X

,Age Group,Gender,Country,Education Level,Recent Job Title,Coding Experience,Industry,Company Size,Num Language
0,50-54,Man,India,Bachelor’s degree,Other,5-10,Manufacturing/Fabrication,50-249,2

In [21]:
X['Education Level'] = X['Education Level'].map(edu_dict)
X['Coding Experience'] = X['Coding Experience'].map(code_dict)
X['Company Size'] = X['Company Size'].map(company_dict)

In [56]:
X.iloc[:, 3]

0    4
Name: Education Level, dtype: int64

In [22]:
X[numeric_cols]

   Education Level  Coding Experience  Num Language  Company Size
0                4                  5             2             2

In [23]:
X

,Age Group,Gender,Country,Education Level,Recent Job Title,Coding Experience,Industry,Company Size,Num Language
0,50-54,Man,India,4,Other,5,Manufacturing/Fabrication,2,2

In [44]:
y_pred = model.predict(X)
y_pred

array([20696.074], dtype=float32)

In [46]:
error = (y - y_pred)[0]
error

6803.42578125

In [57]:
print(f'Error : ${error :,.02f}')

Error : $6,803.43

In [58]:
import numpy as np

In [59]:
X = np.array([[1, 2 , 3], [5, 6, 7]])
X

array([[1, 2, 3],
       [5, 6, 7]])

In [63]:
dfx = pd.DataFrame(X, columns = ['one', 'two', 'three'])

In [64]:
dfx.head()

   one  two  three
0    1    2      3
1    5    6      7